Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
/*
 * RCC.c
 *
 * STM32H7A3 register-level RCC initialization.
 *
 * Requires:
 *   - stm32h7xx.h included before this file, or from your project header.
 *   - The generated clock #defines included before this file.
 *   - Error_Handler() available.
 */

#include "stm32h7xx.h"
#include "STM32H7A3_Clock_Tree.h"
#include "STM32H7A3_RCC.h"

#ifndef RCC_TIMEOUT
#define RCC_TIMEOUT                             1000000U
#endif

#ifndef RCC_HSE_BYPASS_ENABLE
#define RCC_HSE_BYPASS_ENABLE                  	0U
#endif

#ifndef CLOCK_FLASH_LATENCY
#define CLOCK_FLASH_LATENCY                     6U
#endif

#define RCC_PLL_SOURCE_HSI                      0U
#define RCC_PLL_SOURCE_CSI                      1U
#define RCC_PLL_SOURCE_HSE                      2U

#define RCC_SYSCLK_SOURCE_HSI                   0U
#define RCC_SYSCLK_SOURCE_CSI                   1U
#define RCC_SYSCLK_SOURCE_HSE                   2U
#define RCC_SYSCLK_SOURCE_PLL1_P                3U

static void RCC_WriteField(volatile uint32_t *reg,
                           uint32_t mask,
                           uint32_t pos,
                           uint32_t value)
{
    *reg = (*reg & ~mask) | ((value << pos) & mask);
}

static void RCC_WaitSet(volatile uint32_t *reg, uint32_t mask)
{
    uint32_t timeout = RCC_TIMEOUT;

    while(((*reg & mask) == 0U) && (timeout > 0U))
    {
        timeout--;
    }

    if(timeout == 0U)
    {
        while(1); // Error_Handler();
    }
}

static uint32_t RCC_PLLSourceEncode(uint32_t source)
{
    switch(source)
    {
        case RCC_PLL_SOURCE_HSI: return 0x0U;
        case RCC_PLL_SOURCE_CSI: return 0x1U;
        case RCC_PLL_SOURCE_HSE: return 0x2U;
        default:                 return 0x3U;
    }
}

static uint32_t RCC_PrescalerEncode(uint32_t div)
{
    switch(div)
    {
        case 1U:   return 0x0U;
        case 2U:   return 0x8U;
        case 4U:   return 0x9U;
        case 8U:   return 0xAU;
        case 16U:  return 0xBU;
        case 64U:  return 0xCU;
        case 128U: return 0xDU;
        case 256U: return 0xEU;
        case 512U: return 0xFU;
        default:   return 0x0U;
    }
}

static uint32_t RCC_APBPrescalerEncode(uint32_t div)
{
    switch(div)
    {
        case 1U:  return 0x0U;
        case 2U:  return 0x4U;
        case 4U:  return 0x5U;
        case 8U:  return 0x6U;
        case 16U: return 0x7U;
        default:  return 0x0U;
    }
}

static uint32_t RCC_PLLInputRangeEncode(uint32_t input_freq)
{
    if(input_freq < 2000000UL)
    {
        return 0U;
    }
    else if(input_freq < 4000000UL)
    {
        return 1U;
    }
    else if(input_freq < 8000000UL)
    {
        return 2U;
    }
    else
    {
        return 3U;
    }
}

static uint32_t RCC_PLLSourceFreq(uint32_t source)
{
    switch(source)
    {
        case RCC_PLL_SOURCE_HSI: return CLOCK_HSI_FREQ;
        case RCC_PLL_SOURCE_CSI: return CLOCK_CSI_FREQ;
        case RCC_PLL_SOURCE_HSE: return CLOCK_HSE_FREQ;
        default:                 return CLOCK_HSE_FREQ;
    }
}

static uint32_t RCC_SYSCLKSwitchEncode(uint32_t source)
{
    switch(source)
    {
        case RCC_SYSCLK_SOURCE_HSI:    return 0U;
        case RCC_SYSCLK_SOURCE_CSI:    return 1U;
        case RCC_SYSCLK_SOURCE_HSE:    return 2U;
        case RCC_SYSCLK_SOURCE_PLL1_P: return 3U;
        default:                       return 3U;
    }
}

static void RCC_ConfigureFlash(void)
{
#ifdef FLASH_ACR_LATENCY_Msk
    RCC_WriteField(&FLASH->ACR,
                   FLASH_ACR_LATENCY_Msk,
                   FLASH_ACR_LATENCY_Pos,
                   CLOCK_FLASH_LATENCY);
#else
    FLASH->ACR = (FLASH->ACR & ~FLASH_ACR_LATENCY) | CLOCK_FLASH_LATENCY;
#endif

#ifdef FLASH_ACR_LATENCY_Msk
    while((FLASH->ACR & FLASH_ACR_LATENCY_Msk) !=
          ((CLOCK_FLASH_LATENCY << FLASH_ACR_LATENCY_Pos) & FLASH_ACR_LATENCY_Msk))
    {
    }
#endif
}

static void RCC_EnableOscillators(void)
{
#if RCC_HSE_BYPASS_ENABLE
    RCC->CR |= RCC_CR_HSEBYP;
    RCC->CR |= RCC_CR_HSEEXT;
#else
    RCC->CR &= ~RCC_CR_HSEBYP;
#endif

    RCC->CR |= RCC_CR_HSEON;
    RCC_WaitSet(&RCC->CR, RCC_CR_HSERDY);

    RCC->CR |= RCC_CR_HSI48ON;
    RCC_WaitSet(&RCC->CR, RCC_CR_HSI48RDY);

    RCC->CSR |= RCC_CSR_LSION;
    RCC_WaitSet(&RCC->CSR, RCC_CSR_LSIRDY);
}

static void RCC_ConfigurePLL1(void)
{
    RCC->CR &= ~RCC_CR_PLL1ON;

    while((RCC->CR & RCC_CR_PLL1RDY) != 0U)
    {
    }

    RCC_WriteField(&RCC->PLLCKSELR,
                   RCC_PLLCKSELR_PLLSRC_Msk,
                   RCC_PLLCKSELR_PLLSRC_Pos,
                   RCC_PLLSourceEncode(PLL1_SOURCE));

    RCC_WriteField(&RCC->PLLCKSELR,
                   RCC_PLLCKSELR_DIVM1_Msk,
                   RCC_PLLCKSELR_DIVM1_Pos,
                   PLL1_M);

    RCC_WriteField(&RCC->PLLCFGR,
                   RCC_PLLCFGR_PLL1RGE_Msk,
                   RCC_PLLCFGR_PLL1RGE_Pos,
                   RCC_PLLInputRangeEncode(RCC_PLLSourceFreq(PLL1_SOURCE) / PLL1_M));

    /*
     * PLL1 VCO = 8 MHz / 1 * 70 = 560 MHz.
     * Wide VCO range is required.
     */
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1VCOSEL;

    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP1EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ1EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR1EN;

#if PLL1_FRACTIONAL_ENABLE
    RCC->PLLCFGR |= RCC_PLLCFGR_PLL1FRACEN;
#else
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1FRACEN;
#endif

    RCC->PLL1DIVR =
        ((PLL1_N     - 1U) << RCC_PLL1DIVR_N1_Pos) |
        ((PLL1_P_DIV - 1U) << RCC_PLL1DIVR_P1_Pos) |
        ((PLL1_Q_DIV - 1U) << RCC_PLL1DIVR_Q1_Pos) |
        ((PLL1_R_DIV - 1U) << RCC_PLL1DIVR_R1_Pos);

    RCC->PLL1FRACR = PLL1_FRACN << RCC_PLL1FRACR_FRACN1_Pos;

    RCC->CR |= RCC_CR_PLL1ON;
    RCC_WaitSet(&RCC->CR, RCC_CR_PLL1RDY);
}

static void RCC_ConfigurePLL2(void)
{
    RCC->CR &= ~RCC_CR_PLL2ON;

    while((RCC->CR & RCC_CR_PLL2RDY) != 0U)
    {
    }

    RCC_WriteField(&RCC->PLLCKSELR,
                   RCC_PLLCKSELR_DIVM2_Msk,
                   RCC_PLLCKSELR_DIVM2_Pos,
                   PLL2_M);

    RCC_WriteField(&RCC->PLLCFGR,
                   RCC_PLLCFGR_PLL2RGE_Msk,
                   RCC_PLLCFGR_PLL2RGE_Pos,
                   RCC_PLLInputRangeEncode(RCC_PLLSourceFreq(PLL2_SOURCE) / PLL2_M));

