Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP2EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ2EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR2EN;

#if PLL2_FRACTIONAL_ENABLE
    RCC->PLLCFGR |= RCC_PLLCFGR_PLL2FRACEN;
#else
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL2FRACEN;
#endif

    RCC->PLL2DIVR =
        ((PLL2_N     - 1U) << RCC_PLL2DIVR_N2_Pos) |
        ((PLL2_P_DIV - 1U) << RCC_PLL2DIVR_P2_Pos) |
        ((PLL2_Q_DIV - 1U) << RCC_PLL2DIVR_Q2_Pos) |
        ((PLL2_R_DIV - 1U) << RCC_PLL2DIVR_R2_Pos);

    RCC->PLL2FRACR = PLL2_FRACN << RCC_PLL2FRACR_FRACN2_Pos;

    RCC->CR |= RCC_CR_PLL2ON;
    RCC_WaitSet(&RCC->CR, RCC_CR_PLL2RDY);
}

static void RCC_ConfigurePLL3(void)
{
    RCC->CR &= ~RCC_CR_PLL3ON;

    while((RCC->CR & RCC_CR_PLL3RDY) != 0U)
    {
    }

    RCC_WriteField(&RCC->PLLCKSELR,
                   RCC_PLLCKSELR_DIVM3_Msk,
                   RCC_PLLCKSELR_DIVM3_Pos,
                   PLL3_M);

    RCC_WriteField(&RCC->PLLCFGR,
                   RCC_PLLCFGR_PLL3RGE_Msk,
                   RCC_PLLCFGR_PLL3RGE_Pos,
                   RCC_PLLInputRangeEncode(RCC_PLLSourceFreq(PLL3_SOURCE) / PLL3_M));

    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP3EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ3EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR3EN;

#if PLL3_FRACTIONAL_ENABLE
    RCC->PLLCFGR |= RCC_PLLCFGR_PLL3FRACEN;
#else
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL3FRACEN;
#endif

    RCC->PLL3DIVR =
        ((PLL3_N     - 1U) << RCC_PLL3DIVR_N3_Pos) |
        ((PLL3_P_DIV - 1U) << RCC_PLL3DIVR_P3_Pos) |
        ((PLL3_Q_DIV - 1U) << RCC_PLL3DIVR_Q3_Pos) |
        ((PLL3_R_DIV - 1U) << RCC_PLL3DIVR_R3_Pos);

    RCC->PLL3FRACR = PLL3_FRACN << RCC_PLL3FRACR_FRACN3_Pos;

    RCC->CR |= RCC_CR_PLL3ON;
    RCC_WaitSet(&RCC->CR, RCC_CR_PLL3RDY);
}

static void RCC_ConfigureBusDividers(void)
{
    /*
     * STM32H7A3/H7B3 RCC register layout:
     *
     * CDCFGR1:
     *   CDCPRE  = CPU domain prescaler
     *   HPRE    = AHB prescaler
     *
     * CDCFGR2:
     *   CDPPRE1 = APB1 prescaler
     *   CDPPRE2 = APB2 prescaler
     *
     * SRDCFGR:
     *   SRDPPRE = APB4 prescaler
     */

    RCC_WriteField(&RCC->CDCFGR1,
                   RCC_CDCFGR1_CDCPRE_Msk,
                   RCC_CDCFGR1_CDCPRE_Pos,
                   RCC_PrescalerEncode(CLOCK_CPU_DIV));

    RCC_WriteField(&RCC->CDCFGR1,
                   RCC_CDCFGR1_HPRE_Msk,
                   RCC_CDCFGR1_HPRE_Pos,
                   RCC_PrescalerEncode(CLOCK_AHB_DIV));

    RCC_WriteField(&RCC->CDCFGR2,
                   RCC_CDCFGR2_CDPPRE1_Msk,
                   RCC_CDCFGR2_CDPPRE1_Pos,
                   RCC_APBPrescalerEncode(CLOCK_APB1_DIV));

    RCC_WriteField(&RCC->CDCFGR2,
                   RCC_CDCFGR2_CDPPRE2_Msk,
                   RCC_CDCFGR2_CDPPRE2_Pos,
                   RCC_APBPrescalerEncode(CLOCK_APB2_DIV));

    RCC_WriteField(&RCC->SRDCFGR,
                   RCC_SRDCFGR_SRDPPRE_Msk,
                   RCC_SRDCFGR_SRDPPRE_Pos,
                   RCC_APBPrescalerEncode(CLOCK_APB4_DIV));
}

static void RCC_SwitchSYSCLK(void)
{
    uint32_t sw;

    sw = RCC_SYSCLKSwitchEncode(SYSCLK_SOURCE);

    RCC_WriteField(&RCC->CFGR,
                   RCC_CFGR_SW_Msk,
                   RCC_CFGR_SW_Pos,
                   sw);

    while(((RCC->CFGR & RCC_CFGR_SWS_Msk) >> RCC_CFGR_SWS_Pos) != sw)
    {
    }
}


static void RCC_SetVOS(void)
{
    /*
     * Enable SYSCFG clock.
     * Required for VOS0 on STM32H7A3.
     */

    RCC->APB4ENR |= RCC_APB4ENR_SYSCFGEN;

    /*
     * Configure power supply.
     */

    PWR->CR3 &= ~PWR_CR3_SMPSEN;
    PWR->CR3 |=  PWR_CR3_LDOEN;

#if (CLOCK_SYSCLK_FREQ > 225000000UL)

    /*
     * VOS0.
     */

    PWR->SRDCR &= ~PWR_SRDCR_VOS_Msk;
    PWR->SRDCR |=  (3UL << PWR_SRDCR_VOS_Pos);

    while((PWR->SRDCR & PWR_SRDCR_VOSRDY) == 0U);

#elif (CLOCK_SYSCLK_FREQ > 180000000UL)

    /*
     * VOS1.
     */

    PWR->SRDCR &= ~PWR_SRDCR_VOS_Msk;
    PWR->SRDCR |=  (2UL << PWR_SRDCR_VOS_Pos);

    while((PWR->SRDCR & PWR_SRDCR_VOSRDY) == 0U);

#else

    /*
     * VOS2.
     */

    PWR->SRDCR &= ~PWR_SRDCR_VOS_Msk;
    PWR->SRDCR |=  (1UL << PWR_SRDCR_VOS_Pos);

    while((PWR->SRDCR & PWR_SRDCR_VOSRDY) == 0U);

#endif
}

static void RCC_ConfigurePeripheralClocks(void)
{
#ifdef RCC_D1CCIPR_CKPERSEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_CKPERSEL_Msk,
                   RCC_D1CCIPR_CKPERSEL_Pos,
                   PER_CLOCK_SOURCE);
#endif

#ifdef RCC_BDCR_RTCSEL_Msk
    RCC_WriteField(&RCC->BDCR,
                   RCC_BDCR_RTCSEL_Msk,
                   RCC_BDCR_RTCSEL_Pos,
                   CLOCK_RTC_SOURCE);
#endif

#ifdef RCC_CFGR_MCO1SEL_Msk
    RCC_WriteField(&RCC->CFGR,
                   RCC_CFGR_MCO1SEL_Msk,
                   RCC_CFGR_MCO1SEL_Pos,
                   CLOCK_MCO1_SOURCE);
#endif

#ifdef RCC_D1CCIPR_FMCSEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_FMCSEL_Msk,
                   RCC_D1CCIPR_FMCSEL_Pos,
                   CLOCK_FMC_SOURCE);
#endif

#ifdef RCC_D1CCIPR_OSPISEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_OSPISEL_Msk,
                   RCC_D1CCIPR_OSPISEL_Pos,
                   CLOCK_OCTOSPI_SOURCE);
#endif

#ifdef RCC_D1CCIPR_OCTOSPISEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_OCTOSPISEL_Msk,
                   RCC_D1CCIPR_OCTOSPISEL_Pos,
                   CLOCK_OCTOSPI_SOURCE);
#endif

#ifdef RCC_D1CCIPR_SDMMCSEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_SDMMCSEL_Msk,
                   RCC_D1CCIPR_SDMMCSEL_Pos,
                   CLOCK_SDMMC12_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_FDCANSEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_FDCANSEL_Msk,
                   RCC_D2CCIP1R_FDCANSEL_Pos,
                   CLOCK_FDCAN_SOURCE);
#endif

#ifdef RCC_D2CCIP2R_I2C123SEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_I2C123SEL_Msk,
                   RCC_D2CCIP2R_I2C123SEL_Pos,
                   CLOCK_I2C123_SOURCE);
#endif

#ifdef RCC_D3CCIPR_I2C4SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_I2C4SEL_Msk,
                   RCC_D3CCIPR_I2C4SEL_Pos,
                   CLOCK_I2C4_SOURCE);
#endif

#ifdef RCC_D2CCIP2R_USART16910SEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_USART16910SEL_Msk,
                   RCC_D2CCIP2R_USART16910SEL_Pos,
                   CLOCK_USART16910_SOURCE);
#endif

