Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
#ifdef RCC_D2CCIP2R_USART234578SEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_USART234578SEL_Msk,
                   RCC_D2CCIP2R_USART234578SEL_Pos,
                   CLOCK_USART234578_SOURCE);
#endif

#ifdef RCC_D3CCIPR_LPUART1SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_LPUART1SEL_Msk,
                   RCC_D3CCIPR_LPUART1SEL_Pos,
                   CLOCK_LPUART1_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SPI123SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SPI123SEL_Msk,
                   RCC_D2CCIP1R_SPI123SEL_Pos,
                   CLOCK_SPI123_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SPI45SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SPI45SEL_Msk,
                   RCC_D2CCIP1R_SPI45SEL_Pos,
                   CLOCK_SPI45_SOURCE);
#endif

#ifdef RCC_D3CCIPR_SPI6SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_SPI6SEL_Msk,
                   RCC_D3CCIPR_SPI6SEL_Pos,
                   CLOCK_SPI6_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SAI1SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SAI1SEL_Msk,
                   RCC_D2CCIP1R_SAI1SEL_Pos,
                   CLOCK_SAI1_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SAI23SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SAI23SEL_Msk,
                   RCC_D2CCIP1R_SAI23SEL_Pos,
                   CLOCK_SAI2A_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SPDIFSEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SPDIFSEL_Msk,
                   RCC_D2CCIP1R_SPDIFSEL_Pos,
                   CLOCK_SPDIFRX_SOURCE);
#endif

#ifdef RCC_D2CCIP2R_USBSEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_USBSEL_Msk,
                   RCC_D2CCIP2R_USBSEL_Pos,
                   CLOCK_USB_SOURCE);
#endif

#ifdef RCC_D2CCIP2R_RNGSEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_RNGSEL_Msk,
                   RCC_D2CCIP2R_RNGSEL_Pos,
                   CLOCK_RNG_SOURCE);
#endif

#ifdef RCC_D3CCIPR_ADCSEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_ADCSEL_Msk,
                   RCC_D3CCIPR_ADCSEL_Pos,
                   CLOCK_ADC_SOURCE);
#endif

#ifdef RCC_D1CCIPR_LTDCSEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_LTDCSEL_Msk,
                   RCC_D1CCIPR_LTDCSEL_Pos,
                   CLOCK_LTDC_SOURCE);
#endif

#ifdef RCC_D2CCIP2R_LPTIM1SEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R,
                   RCC_D2CCIP2R_LPTIM1SEL_Msk,
                   RCC_D2CCIP2R_LPTIM1SEL_Pos,
                   CLOCK_LPTIM1_SOURCE);
#endif

#ifdef RCC_D3CCIPR_LPTIM2SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_LPTIM2SEL_Msk,
                   RCC_D3CCIPR_LPTIM2SEL_Pos,
                   CLOCK_LPTIM2_SOURCE);
#endif

#ifdef RCC_D3CCIPR_LPTIM3SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_LPTIM3SEL_Msk,
                   RCC_D3CCIPR_LPTIM3SEL_Pos,
                   CLOCK_LPTIM3_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_SWPMI1SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_SWPMI1SEL_Msk,
                   RCC_D2CCIP1R_SWPMI1SEL_Pos,
                   CLOCK_SWPMI_SOURCE);
#endif

#ifdef RCC_D2CCIP1R_DFSDM1SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R,
                   RCC_D2CCIP1R_DFSDM1SEL_Msk,
                   RCC_D2CCIP1R_DFSDM1SEL_Pos,
                   CLOCK_DFSDM1_SOURCE);
#endif

#ifdef RCC_D3CCIPR_DFSDM2SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR,
                   RCC_D3CCIPR_DFSDM2SEL_Msk,
                   RCC_D3CCIPR_DFSDM2SEL_Pos,
                   CLOCK_DFSDM2_SOURCE);
#endif

#ifdef RCC_D1CCIPR_DCMISEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_DCMISEL_Msk,
                   RCC_D1CCIPR_DCMISEL_Pos,
                   CLOCK_DCMI_PSSI_SOURCE);
#endif

#ifdef RCC_D1CCIPR_TRACESEL_Msk
    RCC_WriteField(&RCC->D1CCIPR,
                   RCC_D1CCIPR_TRACESEL_Msk,
                   RCC_D1CCIPR_TRACESEL_Pos,
                   CLOCK_TRACE_SOURCE);
#endif
}

int32_t RCC_GetKernelFreq(void *peripheral)
{
    /*
     * Timers
     */

    if ((peripheral == TIM1)  ||
        (peripheral == TIM8)  ||
        (peripheral == TIM15) ||
        (peripheral == TIM16) ||
        (peripheral == TIM17))
    {
        if (CLOCK_APB2_DIV == 1U)
        {
            return CLOCK_PCLK2_FREQ;
        }

        return CLOCK_PCLK2_FREQ * 2U;
    }

    if ((peripheral == TIM2)  ||
        (peripheral == TIM3)  ||
        (peripheral == TIM4)  ||
        (peripheral == TIM5)  ||
        (peripheral == TIM6)  ||
        (peripheral == TIM7)  ||
        (peripheral == TIM12) ||
        (peripheral == TIM13) ||
        (peripheral == TIM14))
    {
        if (CLOCK_APB1_DIV == 1U)
        {
            return CLOCK_PCLK1_FREQ;
        }

        return CLOCK_PCLK1_FREQ * 2U;
    }

    /*
     * GPIO
     */

    if ((peripheral == GPIOA) ||
        (peripheral == GPIOB) ||
        (peripheral == GPIOC) ||
        (peripheral == GPIOD) ||
        (peripheral == GPIOE) ||
        (peripheral == GPIOF) ||
        (peripheral == GPIOG) ||
        (peripheral == GPIOH))
    {
        return CLOCK_HCLK_FREQ;
    }

    /*
     * USART / UART
     */

    if ((peripheral == USART1) ||
        (peripheral == USART6))
    {
        return CLOCK_USART16910_FREQ;
    }

#ifdef USART9
    if (peripheral == USART9)
    {
        return CLOCK_USART16910_FREQ;
    }
#endif

#ifdef USART10
    if (peripheral == USART10)
    {
        return CLOCK_USART16910_FREQ;
    }
#endif

    if ((peripheral == USART2) ||
        (peripheral == USART3) ||
        (peripheral == UART4)  ||
        (peripheral == UART5)  ||
        (peripheral == UART7)  ||
        (peripheral == UART8))
    {
        return CLOCK_USART234578_FREQ;
    }

#ifdef LPUART1
    if (peripheral == LPUART1)
    {
        return CLOCK_LPUART1_FREQ;
    }
#endif

