Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
    /*
     * SPI
     */

    if ((peripheral == SPI1) ||
        (peripheral == SPI2) ||
        (peripheral == SPI3))
    {
        return CLOCK_SPI123_FREQ;
    }

    if ((peripheral == SPI4) ||
        (peripheral == SPI5))
    {
        return CLOCK_SPI45_FREQ;
    }

#ifdef SPI6
    if (peripheral == SPI6)
    {
        return CLOCK_SPI6_FREQ;
    }
#endif

    /*
     * I2C
     */

    if ((peripheral == I2C1) ||
        (peripheral == I2C2) ||
        (peripheral == I2C3))
    {
        return CLOCK_I2C123_FREQ;
    }

#ifdef I2C4
    if (peripheral == I2C4)
    {
        return CLOCK_I2C4_FREQ;
    }
#endif

    /*
     * LPTIM
     */

#ifdef LPTIM1
    if (peripheral == LPTIM1)
    {
        return CLOCK_LPTIM1_FREQ;
    }
#endif

#ifdef LPTIM2
    if (peripheral == LPTIM2)
    {
        return CLOCK_LPTIM2_FREQ;
    }
#endif

#ifdef LPTIM3
    if (peripheral == LPTIM3)
    {
        return CLOCK_LPTIM3_FREQ;
    }
#endif

    /*
     * USB
     */

#ifdef USB_OTG_FS
    if (peripheral == USB_OTG_FS)
    {
        return CLOCK_USB_FREQ;
    }
#endif

#ifdef USB_OTG_HS
    if (peripheral == USB_OTG_HS)
    {
        return CLOCK_USB_FREQ;
    }
#endif

    /*
     * ADC
     */

#ifdef ADC1
    if (peripheral == ADC1)
    {
        return CLOCK_ADC_FREQ;
    }
#endif

#ifdef ADC2
    if (peripheral == ADC2)
    {
        return CLOCK_ADC_FREQ;
    }
#endif

    /*
     * SDMMC
     */

#ifdef SDMMC1
    if (peripheral == SDMMC1)
    {
        return CLOCK_SDMMC12_FREQ;
    }
#endif

#ifdef SDMMC2
    if (peripheral == SDMMC2)
    {
        return CLOCK_SDMMC12_FREQ;
    }
#endif

    /*
     * FDCAN
     */

#ifdef FDCAN1
    if (peripheral == FDCAN1)
    {
        return CLOCK_FDCAN_FREQ;
    }
#endif

#ifdef FDCAN2
    if (peripheral == FDCAN2)
    {
        return CLOCK_FDCAN_FREQ;
    }
#endif

    /*
     * FMC / OCTOSPI
     */

#ifdef FMC_Bank1_R
    if (peripheral == FMC_Bank1_R)
    {
        return CLOCK_FMC_FREQ;
    }
#endif

#ifdef OCTOSPI1
    if (peripheral == OCTOSPI1)
    {
        return CLOCK_OCTOSPI_FREQ;
    }
#endif

#ifdef OCTOSPI2
    if (peripheral == OCTOSPI2)
    {
        return CLOCK_OCTOSPI_FREQ;
    }
#endif

    /*
     * SAI
     */

#ifdef SAI1
    if (peripheral == SAI1)
    {
        return CLOCK_SAI1_FREQ;
    }
#endif

#ifdef SAI2
    if (peripheral == SAI2)
    {
        return CLOCK_SAI2A_FREQ;
    }
#endif

    /*
     * SPDIFRX
     */

#ifdef SPDIFRX
    if (peripheral == SPDIFRX)
    {
        return CLOCK_SPDIFRX_FREQ;
    }
#endif

    /*
     * RNG
     */

#ifdef RNG
    if (peripheral == RNG)
    {
        return CLOCK_RNG_FREQ;
    }
#endif

    /*
     * LTDC
     */

#ifdef LTDC
    if (peripheral == LTDC)
    {
        return CLOCK_LTDC_FREQ;
    }
#endif

    /*
     * CEC
     */

#ifdef HDMI_CEC
    if (peripheral == HDMI_CEC)
    {
        return CLOCK_CEC_FREQ;
    }
#endif

#ifdef CEC
    if (peripheral == CEC)
    {
        return CLOCK_CEC_FREQ;
    }
#endif

    /*
     * DCMI / PSSI
     */

#ifdef DCMI
    if (peripheral == DCMI)
    {
        return CLOCK_DCMI_PSSI_FREQ;
    }
#endif

#ifdef PSSI
    if (peripheral == PSSI)
    {
        return CLOCK_DCMI_PSSI_FREQ;
    }
#endif

    /*
     * SWPMI
     */

#ifdef SWPMI1
    if (peripheral == SWPMI1)
    {
        return CLOCK_SWPMI_FREQ;
    }
#endif

    /*
     * DFSDM
     */

#ifdef DFSDM1_Channel0
    if (peripheral == DFSDM1_Channel0)
    {
        return CLOCK_DFSDM1_FREQ;
    }
#endif

#ifdef DFSDM2_Channel0
    if (peripheral == DFSDM2_Channel0)
    {
        return CLOCK_DFSDM2_FREQ;
    }
#endif

    return 0U;
}

int32_t RCC_DisablePeripheralClock(void *Peripheral)
{
#define RCC_DISABLE_IF(PERIPH, REG, BIT)       \
    do                                         \
    {                                          \
        if(Peripheral == (void *)(PERIPH))     \
        {                                      \
            RCC->REG &= ~(BIT);                \
            (void)RCC->REG;                    \
            return 0;                          \
        }                                      \
    } while(0)

#ifdef GPIOA
    RCC_DISABLE_IF(GPIOA, AHB4ENR, RCC_AHB4ENR_GPIOAEN);
#endif

#ifdef GPIOB
    RCC_DISABLE_IF(GPIOB, AHB4ENR, RCC_AHB4ENR_GPIOBEN);
#endif

#ifdef GPIOC
    RCC_DISABLE_IF(GPIOC, AHB4ENR, RCC_AHB4ENR_GPIOCEN);
#endif

#ifdef GPIOD
    RCC_DISABLE_IF(GPIOD, AHB4ENR, RCC_AHB4ENR_GPIODEN);
#endif

#ifdef GPIOE
    RCC_DISABLE_IF(GPIOE, AHB4ENR, RCC_AHB4ENR_GPIOEEN);
#endif

#ifdef GPIOF
    RCC_DISABLE_IF(GPIOF, AHB4ENR, RCC_AHB4ENR_GPIOFEN);
#endif

#ifdef GPIOG
    RCC_DISABLE_IF(GPIOG, AHB4ENR, RCC_AHB4ENR_GPIOGEN);
#endif

#ifdef GPIOH
    RCC_DISABLE_IF(GPIOH, AHB4ENR, RCC_AHB4ENR_GPIOHEN);
#endif

#ifdef GPIOI
    RCC_DISABLE_IF(GPIOI, AHB4ENR, RCC_AHB4ENR_GPIOIEN);
#endif

#ifdef GPIOJ
    RCC_DISABLE_IF(GPIOJ, AHB4ENR, RCC_AHB4ENR_GPIOJEN);
#endif

#ifdef GPIOK
    RCC_DISABLE_IF(GPIOK, AHB4ENR, RCC_AHB4ENR_GPIOKEN);
#endif

#ifdef I2C1
    RCC_DISABLE_IF(I2C1, APB1LENR, RCC_APB1LENR_I2C1EN);
#endif

#ifdef I2C2
    RCC_DISABLE_IF(I2C2, APB1LENR, RCC_APB1LENR_I2C2EN);
#endif

#ifdef I2C3
    RCC_DISABLE_IF(I2C3, APB1LENR, RCC_APB1LENR_I2C3EN);
#endif

#ifdef I2C4
    RCC_DISABLE_IF(I2C4, APB4ENR, RCC_APB4ENR_I2C4EN);
#endif

#ifdef USART1
    RCC_DISABLE_IF(USART1, APB2ENR, RCC_APB2ENR_USART1EN);
#endif

#ifdef USART2
    RCC_DISABLE_IF(USART2, APB1LENR, RCC_APB1LENR_USART2EN);
#endif

#ifdef USART3
    RCC_DISABLE_IF(USART3, APB1LENR, RCC_APB1LENR_USART3EN);
#endif

#ifdef UART4
    RCC_DISABLE_IF(UART4, APB1LENR, RCC_APB1LENR_UART4EN);
#endif

#ifdef UART5
    RCC_DISABLE_IF(UART5, APB1LENR, RCC_APB1LENR_UART5EN);
#endif

#ifdef USART6
    RCC_DISABLE_IF(USART6, APB2ENR, RCC_APB2ENR_USART6EN);
#endif

#ifdef UART7
    RCC_DISABLE_IF(UART7, APB1LENR, RCC_APB1LENR_UART7EN);
#endif

#ifdef UART8
    RCC_DISABLE_IF(UART8, APB1LENR, RCC_APB1LENR_UART8EN);
#endif

#ifdef LTDC
    RCC_DISABLE_IF(LTDC, APB3ENR, RCC_APB3ENR_LTDCEN);
#endif

#ifdef DMA2D
    RCC_DISABLE_IF(DMA2D, AHB3ENR, RCC_AHB3ENR_DMA2DEN);
#endif

#ifdef FMC_Bank1_R
    RCC_DISABLE_IF(FMC_Bank1_R, AHB3ENR, RCC_AHB3ENR_FMCEN);
#endif

#ifdef OCTOSPI1
    RCC_DISABLE_IF(OCTOSPI1, AHB3ENR, RCC_AHB3ENR_OSPI1EN);
#endif

#ifdef OCTOSPI2
    RCC_DISABLE_IF(OCTOSPI2, AHB3ENR, RCC_AHB3ENR_OSPI2EN);
#endif

#undef RCC_DISABLE_IF

    return -1;
}

int32_t RCC_ResetPeripheral(void *Peripheral)
{
#define RCC_RESET_IF(PERIPH, REG, BIT)         \
    do                                         \
    {                                          \
        if(Peripheral == (void *)(PERIPH))     \
        {                                      \
            RCC->REG |= (BIT);                 \
            RCC->REG &= ~(BIT);                \
            return 0;                          \
        }                                      \
    } while(0)

#ifdef GPIOA
    RCC_RESET_IF(GPIOA, AHB4RSTR, RCC_AHB4RSTR_GPIOARST);
#endif

#ifdef GPIOB
    RCC_RESET_IF(GPIOB, AHB4RSTR, RCC_AHB4RSTR_GPIOBRST);
#endif

#ifdef GPIOC
    RCC_RESET_IF(GPIOC, AHB4RSTR, RCC_AHB4RSTR_GPIOCRST);
#endif

