Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
#ifdef GPIOD
    RCC_RESET_IF(GPIOD, AHB4RSTR, RCC_AHB4RSTR_GPIODRST);
#endif

#ifdef GPIOE
    RCC_RESET_IF(GPIOE, AHB4RSTR, RCC_AHB4RSTR_GPIOERST);
#endif

#ifdef GPIOF
    RCC_RESET_IF(GPIOF, AHB4RSTR, RCC_AHB4RSTR_GPIOFRST);
#endif

#ifdef GPIOG
    RCC_RESET_IF(GPIOG, AHB4RSTR, RCC_AHB4RSTR_GPIOGRST);
#endif

#ifdef GPIOH
    RCC_RESET_IF(GPIOH, AHB4RSTR, RCC_AHB4RSTR_GPIOHRST);
#endif

#ifdef I2C1
    RCC_RESET_IF(I2C1, APB1LRSTR, RCC_APB1LRSTR_I2C1RST);
#endif

#ifdef I2C2
    RCC_RESET_IF(I2C2, APB1LRSTR, RCC_APB1LRSTR_I2C2RST);
#endif

#ifdef I2C3
    RCC_RESET_IF(I2C3, APB1LRSTR, RCC_APB1LRSTR_I2C3RST);
#endif

#ifdef I2C4
    RCC_RESET_IF(I2C4, APB4RSTR, RCC_APB4RSTR_I2C4RST);
#endif

#ifdef USART1
    RCC_RESET_IF(USART1, APB2RSTR, RCC_APB2RSTR_USART1RST);
#endif

#ifdef USART2
    RCC_RESET_IF(USART2, APB1LRSTR, RCC_APB1LRSTR_USART2RST);
#endif

#ifdef USART3
    RCC_RESET_IF(USART3, APB1LRSTR, RCC_APB1LRSTR_USART3RST);
#endif

#ifdef UART4
    RCC_RESET_IF(UART4, APB1LRSTR, RCC_APB1LRSTR_UART4RST);
#endif

#ifdef UART5
    RCC_RESET_IF(UART5, APB1LRSTR, RCC_APB1LRSTR_UART5RST);
#endif

#ifdef USART6
    RCC_RESET_IF(USART6, APB2RSTR, RCC_APB2RSTR_USART6RST);
#endif

#ifdef UART7
    RCC_RESET_IF(UART7, APB1LRSTR, RCC_APB1LRSTR_UART7RST);
#endif

#ifdef UART8
    RCC_RESET_IF(UART8, APB1LRSTR, RCC_APB1LRSTR_UART8RST);
#endif

#ifdef LTDC
    RCC_RESET_IF(LTDC, APB3RSTR, RCC_APB3RSTR_LTDCRST);
#endif

#ifdef DMA2D
    RCC_RESET_IF(DMA2D, AHB3RSTR, RCC_AHB3RSTR_DMA2DRST);
#endif

#ifdef FMC_Bank1_R
    RCC_RESET_IF(FMC_Bank1_R, AHB3RSTR, RCC_AHB3RSTR_FMCRST);
#endif

#ifdef OCTOSPI1
    RCC_RESET_IF(OCTOSPI1, AHB3RSTR, RCC_AHB3RSTR_OSPI1RST);
#endif

#ifdef OCTOSPI2
    RCC_RESET_IF(OCTOSPI2, AHB3RSTR, RCC_AHB3RSTR_OSPI2RST);
#endif

#undef RCC_RESET_IF

    return -1;
}

int32_t RCC_EnablePeripheralClock(void *Peripheral)
{
#define RCC_ENABLE_IF(PERIPH, REG, BIT)        \
    do                                         \
    {                                          \
        if(Peripheral == (void *)(PERIPH))     \
        {                                      \
            RCC->REG |= (BIT);                 \
            (void)RCC->REG;                    \
            return 0;                          \
        }                                      \
    } while(0)

    /*
     * AHB1
     */

#ifdef DMA1
    RCC_ENABLE_IF(DMA1, AHB1ENR, RCC_AHB1ENR_DMA1EN);
#endif

#ifdef DMA2
    RCC_ENABLE_IF(DMA2, AHB1ENR, RCC_AHB1ENR_DMA2EN);
#endif

#ifdef ADC12_COMMON
    RCC_ENABLE_IF(ADC12_COMMON, AHB1ENR, RCC_AHB1ENR_ADC12EN);
#endif

#ifdef ETH
#ifdef RCC_AHB1ENR_ETH1MACEN
    RCC_ENABLE_IF(ETH, AHB1ENR, RCC_AHB1ENR_ETH1MACEN);
#endif
#endif

    /*
     * AHB2
     */

#ifdef DCMI
#ifdef RCC_AHB2ENR_DCMIEN
    RCC_ENABLE_IF(DCMI, AHB2ENR, RCC_AHB2ENR_DCMIEN);
#endif
#endif

#ifdef RNG
#ifdef RCC_AHB2ENR_RNGEN
    RCC_ENABLE_IF(RNG, AHB2ENR, RCC_AHB2ENR_RNGEN);
#endif
#endif

#ifdef HASH
#ifdef RCC_AHB2ENR_HASHEN
    RCC_ENABLE_IF(HASH, AHB2ENR, RCC_AHB2ENR_HASHEN);
#endif
#endif

#ifdef CRYP
#ifdef RCC_AHB2ENR_CRYPEN
    RCC_ENABLE_IF(CRYP, AHB2ENR, RCC_AHB2ENR_CRYPEN);
#endif
#endif

#ifdef SDMMC2
#ifdef RCC_AHB2ENR_SDMMC2EN
    RCC_ENABLE_IF(SDMMC2, AHB2ENR, RCC_AHB2ENR_SDMMC2EN);
#endif
#endif

    /*
     * AHB3
     */

#ifdef FMC_Bank1_R
#ifdef RCC_AHB3ENR_FMCEN
    RCC_ENABLE_IF(FMC_Bank1_R, AHB3ENR, RCC_AHB3ENR_FMCEN);
#endif
#endif

#ifdef OCTOSPI1
#ifdef RCC_AHB3ENR_OCTOSPI1EN
    RCC_ENABLE_IF(OCTOSPI1, AHB3ENR, RCC_AHB3ENR_OCTOSPI1EN);
#endif
#endif

#ifdef OCTOSPI2
#ifdef RCC_AHB3ENR_OCTOSPI2EN
    RCC_ENABLE_IF(OCTOSPI2, AHB3ENR, RCC_AHB3ENR_OCTOSPI2EN);
#endif
#endif

#ifdef SDMMC1
#ifdef RCC_AHB3ENR_SDMMC1EN
    RCC_ENABLE_IF(SDMMC1, AHB3ENR, RCC_AHB3ENR_SDMMC1EN);
#endif
#endif

#ifdef JPEG
#ifdef RCC_AHB3ENR_JPEGEN
    RCC_ENABLE_IF(JPEG, AHB3ENR, RCC_AHB3ENR_JPEGEN);
#endif
#endif

#ifdef DMA2D
#ifdef RCC_AHB3ENR_DMA2DEN
    RCC_ENABLE_IF(DMA2D, AHB3ENR, RCC_AHB3ENR_DMA2DEN);
#endif
#endif

#ifdef MDMA
#ifdef RCC_AHB3ENR_MDMAEN
    RCC_ENABLE_IF(MDMA, AHB3ENR, RCC_AHB3ENR_MDMAEN);
#endif
#endif

    /*
     * AHB4
     */

#ifdef GPIOA
    RCC_ENABLE_IF(GPIOA, AHB4ENR, RCC_AHB4ENR_GPIOAEN);
#endif
#ifdef GPIOB
    RCC_ENABLE_IF(GPIOB, AHB4ENR, RCC_AHB4ENR_GPIOBEN);
#endif
#ifdef GPIOC
    RCC_ENABLE_IF(GPIOC, AHB4ENR, RCC_AHB4ENR_GPIOCEN);
#endif
#ifdef GPIOD
    RCC_ENABLE_IF(GPIOD, AHB4ENR, RCC_AHB4ENR_GPIODEN);
#endif
#ifdef GPIOE
    RCC_ENABLE_IF(GPIOE, AHB4ENR, RCC_AHB4ENR_GPIOEEN);
#endif
#ifdef GPIOF
    RCC_ENABLE_IF(GPIOF, AHB4ENR, RCC_AHB4ENR_GPIOFEN);
#endif
#ifdef GPIOG
    RCC_ENABLE_IF(GPIOG, AHB4ENR, RCC_AHB4ENR_GPIOGEN);
#endif
#ifdef GPIOH
    RCC_ENABLE_IF(GPIOH, AHB4ENR, RCC_AHB4ENR_GPIOHEN);
#endif
#ifdef GPIOI
    RCC_ENABLE_IF(GPIOI, AHB4ENR, RCC_AHB4ENR_GPIOIEN);
#endif
#ifdef GPIOJ
    RCC_ENABLE_IF(GPIOJ, AHB4ENR, RCC_AHB4ENR_GPIOJEN);
#endif
#ifdef GPIOK
    RCC_ENABLE_IF(GPIOK, AHB4ENR, RCC_AHB4ENR_GPIOKEN);
#endif

#ifdef CRC
#ifdef RCC_AHB4ENR_CRCEN
    RCC_ENABLE_IF(CRC, AHB4ENR, RCC_AHB4ENR_CRCEN);
#endif
#endif

#ifdef BDMA
#ifdef RCC_AHB4ENR_BDMAEN
    RCC_ENABLE_IF(BDMA, AHB4ENR, RCC_AHB4ENR_BDMAEN);
#endif
#endif

#ifdef ADC3
#ifdef RCC_AHB4ENR_ADC3EN
    RCC_ENABLE_IF(ADC3, AHB4ENR, RCC_AHB4ENR_ADC3EN);
#endif
#endif

#ifdef HSEM
#ifdef RCC_AHB4ENR_HSEMEN
    RCC_ENABLE_IF(HSEM, AHB4ENR, RCC_AHB4ENR_HSEMEN);
#endif
#endif

    /*
     * APB1 Low
     */

#ifdef TIM2
    RCC_ENABLE_IF(TIM2, APB1LENR, RCC_APB1LENR_TIM2EN);
#endif
#ifdef TIM3
    RCC_ENABLE_IF(TIM3, APB1LENR, RCC_APB1LENR_TIM3EN);
#endif
#ifdef TIM4
    RCC_ENABLE_IF(TIM4, APB1LENR, RCC_APB1LENR_TIM4EN);
#endif
#ifdef TIM5
    RCC_ENABLE_IF(TIM5, APB1LENR, RCC_APB1LENR_TIM5EN);
#endif
#ifdef TIM6
    RCC_ENABLE_IF(TIM6, APB1LENR, RCC_APB1LENR_TIM6EN);
#endif
#ifdef TIM7
    RCC_ENABLE_IF(TIM7, APB1LENR, RCC_APB1LENR_TIM7EN);
#endif
#ifdef TIM12
    RCC_ENABLE_IF(TIM12, APB1LENR, RCC_APB1LENR_TIM12EN);
#endif
#ifdef TIM13
    RCC_ENABLE_IF(TIM13, APB1LENR, RCC_APB1LENR_TIM13EN);
#endif
#ifdef TIM14
    RCC_ENABLE_IF(TIM14, APB1LENR, RCC_APB1LENR_TIM14EN);
#endif

#ifdef LPTIM1
    RCC_ENABLE_IF(LPTIM1, APB1LENR, RCC_APB1LENR_LPTIM1EN);
#endif

#ifdef SPI2
    RCC_ENABLE_IF(SPI2, APB1LENR, RCC_APB1LENR_SPI2EN);
#endif
#ifdef SPI3
    RCC_ENABLE_IF(SPI3, APB1LENR, RCC_APB1LENR_SPI3EN);
#endif

#ifdef SPDIFRX
#ifdef RCC_APB1LENR_SPDIFRXEN
    RCC_ENABLE_IF(SPDIFRX, APB1LENR, RCC_APB1LENR_SPDIFRXEN);
#endif
#endif

#ifdef USART2
    RCC_ENABLE_IF(USART2, APB1LENR, RCC_APB1LENR_USART2EN);
#endif
#ifdef USART3
    RCC_ENABLE_IF(USART3, APB1LENR, RCC_APB1LENR_USART3EN);
#endif
#ifdef UART4
    RCC_ENABLE_IF(UART4, APB1LENR, RCC_APB1LENR_UART4EN);
#endif
#ifdef UART5
    RCC_ENABLE_IF(UART5, APB1LENR, RCC_APB1LENR_UART5EN);
#endif

#ifdef I2C1
    RCC_ENABLE_IF(I2C1, APB1LENR, RCC_APB1LENR_I2C1EN);
#endif
#ifdef I2C2
    RCC_ENABLE_IF(I2C2, APB1LENR, RCC_APB1LENR_I2C2EN);
#endif
#ifdef I2C3
    RCC_ENABLE_IF(I2C3, APB1LENR, RCC_APB1LENR_I2C3EN);
#endif

#ifdef CEC
#ifdef RCC_APB1LENR_CECEN
    RCC_ENABLE_IF(CEC, APB1LENR, RCC_APB1LENR_CECEN);
#endif
#endif

