Jack-Herron/STM32_Skipper_Development/STM32H7A3_DualSlide/Platform/Src/STM32H7A3_RCC.c
#ifdef HDMI_CEC
#ifdef RCC_APB1LENR_CECEN
    RCC_ENABLE_IF(HDMI_CEC, APB1LENR, RCC_APB1LENR_CECEN);
#endif
#endif

#ifdef DAC1
#ifdef RCC_APB1LENR_DAC12EN
    RCC_ENABLE_IF(DAC1, APB1LENR, RCC_APB1LENR_DAC12EN);
#endif
#endif

#ifdef UART7
    RCC_ENABLE_IF(UART7, APB1LENR, RCC_APB1LENR_UART7EN);
#endif
#ifdef UART8
    RCC_ENABLE_IF(UART8, APB1LENR, RCC_APB1LENR_UART8EN);
#endif

    /*
     * APB1 High
     */

#ifdef CRS
#ifdef RCC_APB1HENR_CRSEN
    RCC_ENABLE_IF(CRS, APB1HENR, RCC_APB1HENR_CRSEN);
#endif
#endif

#ifdef SWPMI1
#ifdef RCC_APB1HENR_SWPMIEN
    RCC_ENABLE_IF(SWPMI1, APB1HENR, RCC_APB1HENR_SWPMIEN);
#endif
#endif

#ifdef OPAMP
#ifdef RCC_APB1HENR_OPAMPEN
    RCC_ENABLE_IF(OPAMP, APB1HENR, RCC_APB1HENR_OPAMPEN);
#endif
#endif

#ifdef MDIOS
#ifdef RCC_APB1HENR_MDIOSEN
    RCC_ENABLE_IF(MDIOS, APB1HENR, RCC_APB1HENR_MDIOSEN);
#endif
#endif

#ifdef FDCAN1
#ifdef RCC_APB1HENR_FDCANEN
    RCC_ENABLE_IF(FDCAN1, APB1HENR, RCC_APB1HENR_FDCANEN);
#endif
#endif

#ifdef FDCAN2
#ifdef RCC_APB1HENR_FDCANEN
    RCC_ENABLE_IF(FDCAN2, APB1HENR, RCC_APB1HENR_FDCANEN);
#endif
#endif

    /*
     * APB2
     */

#ifdef TIM1
    RCC_ENABLE_IF(TIM1, APB2ENR, RCC_APB2ENR_TIM1EN);
#endif
#ifdef TIM8
    RCC_ENABLE_IF(TIM8, APB2ENR, RCC_APB2ENR_TIM8EN);
#endif

#ifdef USART1
    RCC_ENABLE_IF(USART1, APB2ENR, RCC_APB2ENR_USART1EN);
#endif
#ifdef USART6
    RCC_ENABLE_IF(USART6, APB2ENR, RCC_APB2ENR_USART6EN);
#endif

#ifdef SPI1
    RCC_ENABLE_IF(SPI1, APB2ENR, RCC_APB2ENR_SPI1EN);
#endif
#ifdef SPI4
    RCC_ENABLE_IF(SPI4, APB2ENR, RCC_APB2ENR_SPI4EN);
#endif

#ifdef TIM15
    RCC_ENABLE_IF(TIM15, APB2ENR, RCC_APB2ENR_TIM15EN);
#endif
#ifdef TIM16
    RCC_ENABLE_IF(TIM16, APB2ENR, RCC_APB2ENR_TIM16EN);
#endif
#ifdef TIM17
    RCC_ENABLE_IF(TIM17, APB2ENR, RCC_APB2ENR_TIM17EN);
#endif

#ifdef SPI5
    RCC_ENABLE_IF(SPI5, APB2ENR, RCC_APB2ENR_SPI5EN);
#endif

#ifdef SAI1
#ifdef RCC_APB2ENR_SAI1EN
    RCC_ENABLE_IF(SAI1, APB2ENR, RCC_APB2ENR_SAI1EN);
#endif
#endif

#ifdef SAI2
#ifdef RCC_APB2ENR_SAI2EN
    RCC_ENABLE_IF(SAI2, APB2ENR, RCC_APB2ENR_SAI2EN);
#endif
#endif

#ifdef SAI3
#ifdef RCC_APB2ENR_SAI3EN
    RCC_ENABLE_IF(SAI3, APB2ENR, RCC_APB2ENR_SAI3EN);
#endif
#endif

#ifdef DFSDM1_Channel0
#ifdef RCC_APB2ENR_DFSDM1EN
    RCC_ENABLE_IF(DFSDM1_Channel0, APB2ENR, RCC_APB2ENR_DFSDM1EN);
#endif
#endif

#ifdef HRTIM1
#ifdef RCC_APB2ENR_HRTIMEN
    RCC_ENABLE_IF(HRTIM1, APB2ENR, RCC_APB2ENR_HRTIMEN);
#endif
#endif

    /*
     * APB3
     */

#ifdef LTDC
#ifdef RCC_APB3ENR_LTDCEN
    RCC_ENABLE_IF(LTDC, APB3ENR, RCC_APB3ENR_LTDCEN);
#endif
#endif

#ifdef DSI
#ifdef RCC_APB3ENR_DSIEN
    RCC_ENABLE_IF(DSI, APB3ENR, RCC_APB3ENR_DSIEN);
#endif
#endif

#ifdef WWDG1
#ifdef RCC_APB3ENR_WWDG1EN
    RCC_ENABLE_IF(WWDG1, APB3ENR, RCC_APB3ENR_WWDG1EN);
#endif
#endif

    /*
     * APB4
     */

#ifdef SYSCFG
#ifdef RCC_APB4ENR_SYSCFGEN
    RCC_ENABLE_IF(SYSCFG, APB4ENR, RCC_APB4ENR_SYSCFGEN);
#endif
#endif

#ifdef LPUART1
#ifdef RCC_APB4ENR_LPUART1EN
    RCC_ENABLE_IF(LPUART1, APB4ENR, RCC_APB4ENR_LPUART1EN);
#endif
#endif

#ifdef SPI6
#ifdef RCC_APB4ENR_SPI6EN
    RCC_ENABLE_IF(SPI6, APB4ENR, RCC_APB4ENR_SPI6EN);
#endif
#endif

#ifdef I2C4
#ifdef RCC_APB4ENR_I2C4EN
    RCC_ENABLE_IF(I2C4, APB4ENR, RCC_APB4ENR_I2C4EN);
#endif
#endif

#ifdef LPTIM2
#ifdef RCC_APB4ENR_LPTIM2EN
    RCC_ENABLE_IF(LPTIM2, APB4ENR, RCC_APB4ENR_LPTIM2EN);
#endif
#endif

#ifdef LPTIM3
#ifdef RCC_APB4ENR_LPTIM3EN
    RCC_ENABLE_IF(LPTIM3, APB4ENR, RCC_APB4ENR_LPTIM3EN);
#endif
#endif

#ifdef LPTIM4
#ifdef RCC_APB4ENR_LPTIM4EN
    RCC_ENABLE_IF(LPTIM4, APB4ENR, RCC_APB4ENR_LPTIM4EN);
#endif
#endif

#ifdef LPTIM5
#ifdef RCC_APB4ENR_LPTIM5EN
    RCC_ENABLE_IF(LPTIM5, APB4ENR, RCC_APB4ENR_LPTIM5EN);
#endif
#endif

#ifdef COMP1
#ifdef RCC_APB4ENR_COMP12EN
    RCC_ENABLE_IF(COMP1, APB4ENR, RCC_APB4ENR_COMP12EN);
#endif
#endif

#ifdef COMP2
#ifdef RCC_APB4ENR_COMP12EN
    RCC_ENABLE_IF(COMP2, APB4ENR, RCC_APB4ENR_COMP12EN);
#endif
#endif

#ifdef VREFBUF
#ifdef RCC_APB4ENR_VREFEN
    RCC_ENABLE_IF(VREFBUF, APB4ENR, RCC_APB4ENR_VREFEN);
#endif
#endif

#ifdef RTC
#ifdef RCC_APB4ENR_RTCAPBEN
    RCC_ENABLE_IF(RTC, APB4ENR, RCC_APB4ENR_RTCAPBEN);
#endif
#endif

#ifdef SAI4
#ifdef RCC_APB4ENR_SAI4EN
    RCC_ENABLE_IF(SAI4, APB4ENR, RCC_APB4ENR_SAI4EN);
#endif
#endif

#undef RCC_ENABLE_IF

    return -1;
}

void RCC_Init(void)
{
    RCC->CKGAENR = 0xFFFFFFFFUL;

    RCC_SetVOS();

    RCC_ConfigureFlash();

    RCC_EnableOscillators();

    RCC_ConfigurePLL1();
    RCC_ConfigurePLL2();
    RCC_ConfigurePLL3();

    RCC_ConfigureBusDividers();

    RCC_ConfigurePeripheralClocks();

    RCC_SwitchSYSCLK();
}

